Repository: 84000/data-translation-memory
Catalog: toh84_84000-the-questions-of-the-girl-vimalasraddha.tmx
Source language: bo
Languages: en

source: །ལོག་པའི་ལས་ཅན་སྡུད་པར་བྱེད།
en: They draw in those who act wrongly.

source: །རྟག་པར་ཡང་དག་རྩོལ་བསྒོམས་ནས།
en: “Continuously cultivating right effort,

source: །ལོག་བརྩོན་དག་ནི་སྤོང་བར་བྱེད།
en: They do not abandon those with wrong effort.

source: །ཡང་དག་འཚོ་བས་རྗེས་འཐུན་པས།
en: Pursuing right livelihood,

source: །ལོག་འཚོ་གང་ཡིན་སྡུད་པར་བྱེད།
en: They draw in those engaged in wrong livelihoods.

source: །བློ་ལྡན་ཡང་དག་རྟོག་པ་ཡིས།
en: “The wise ones who have right thought

source: །ལོག་པར་ཡིད་བྱེད་བརྩེ་བར་སེམས།
en: Think compassionately toward those who think wrongly.

source: །ཡང་དག་ཏིང་འཛིན་རྟག་གནས་ནས།
en: Always absorbed in right absorption,

source: །ལོག་པའི་ཏིང་འཛིན་སྡུད་པར་བྱེད།
en: They draw in those caught up in wrong absorption.

source: །བླ་མེད་ཡང་དག་ལམ་བརྒྱད་ཀྱིས།
en: “With this unsurpassed perfect eightfold path,

source: །ཆུ་བོ་དག་ལ་སྒྲོལ་བར་བྱེད།
en: They liberate those who are caught in the river of saṃsāra.

source: །རྒྱུན་ཕྱོགས་དེད་པ་ཟློག་བྱེད་པས།
en: By rescuing those who are carried away by the stream,

source: །དེ་ནི་བྱང་ཆུབ་ལམ་ཆེན་ཡིན།
en: They are on the great path to awakening.

source: །ཉན་ཐོས་དང་ནི་རང་རྒྱལ་རྣམས།
en: “Hearers and solitary realizers

source: །རྩྭ་ཡི་གཟིངས་བཞིན་བདག་ཉིད་ཟློས།
en: Transport only themselves, like on a raft made of grass.

source: །བྱང་ཆུབ་སེམས་དཔའ་ཀུན་ཟློས་པས།
en: A bodhisattva leads everyone across,

source: །དཔེར་ན་གྲུ་ཆེན་འདྲེན་མཁན་འདྲ།
en: Like the captain of a great boat.

source: །གཞན་ཡང་བུ་མོ་བྱང་ཆུབ་སེམས་དཔའ་ནི་ཆོས་རྣམ་པ་བརྒྱད་དང་ལྡན་པའི་ཕྱིར། བདུད་རྩིའི་ལམ་མངོན་སུམ་དུ་བྱེད་པར་འགྱུར་རོ།
en: “Furthermore, girl, because bodhisattvas are endowed with eight qualities, they have direct experience of the deathless path.

source: རྩོད་པ་མེད་པའི་ཆོས་ལ་གནས་པ་དང་། ཐོགས་པའི་སེམས་ལེགས་པར་རབ་ཏུ་སྲུང་བར་བྱེད་པ་དང་། རྟག་པར་དེ་ཁོ་ན་ཉིད་ཀྱི་དོན་ལ་ལྟ་བར་བྱེད་པ་དང་། བྱང་ཆུབ་ཀྱི་སེམས་ལ་རབ་ཏུ་གནས་ནས།
en: Abiding in the strifeless Dharma; guarding themselves well against thoughts of hostility; constantly contemplating the meaning of suchness;

source: རྗེས་སུ་དྲན་པ་དྲུག་སྒོམ་པར་བྱེད་པ་དང་། ནན་ཏན་བརྩོན་འགྲུས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་རྣམས་སྒོམ་པར་བྱེད་པ་དང་། དགེ་བའི་རྩ་བ་བསགས་ནས་སེམས་ཅན་ཡོངས་སུ་སྨིན་པར་བྱེད་པ་དང་། སྙིང་རྗེ་ཆེན་པོ་ལ་གནས་ནས་ཡང་དག་པའི་ཆོས་ཡོངས་སུ་སྡུད་པར་བྱེད་པ་དང་། མི་སྐྱེ་བའི་ཆོས་ལ་བཟོད་པ་ཐོབ་ནས།
en: sustaining the mind set on awakening, and meditating on the six recollections; meditating on the transcendental perfections with meticulous perseverance; collecting roots of virtue, and ripening sentient beings; sustaining great compassion, and drawing beings to the perfect Dharma; and attaining the acceptance that phenomena do not arise, and remaining in the irreversible condition.”

source: ཕྱིར་མི་ལྡོག་པ་ལ་རབ་ཏུ་གནས་པ་གང་ཡིན་པའོ། །དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་ཡང་ཚིགས་སུ་བཅད་དེ་བཀའ་སྩལ་པ།
en: Then the Blessed One spoke again in verse:

source: རྟག་པར་རྩོད་མེད་སྤྱོད་བསྒྲུབས་ནས།
en: “Always achieving conduct that is without strife,

source: །དགེ་སྦྱོང་ཆེན་པོའི་ཆོས་ལ་གནས།
en: They abide in the Dharma of the Great Ascetic.

source: །ཞེ་སྡང་ཉེས་པ་ཡོངས་སྤངས་ནས།
en: Abandoning the shortcoming of hatred,

source: །དགེ་བའི་རྩ་བ་སོགས་པར་བྱེད།
en: They gather roots of virtue.

source: །ཡང་དག་དོན་ལ་རབ་ལྟ་བས།
en: “By contemplating the right meaning,

source: །མི་ཟད་སྤོབས་རྣམས་འཐོབ་པར་བྱེད།
en: They obtain inexhaustible eloquence;

source: །བྱང་ཆུབ་སེམས་ལ་རབ་གནས་ནས།
en: And, sustaining in the mind set on awakening,

source: །རྟག་པར་དྲན་བྱེད་རྗེས་སུ་དྲན།
en: They always remember the six recollections.

source: །ཕ་རོལ་ཕྱིན་པ་ཐམས་ཅད་ལ།
en: “Accomplishing all the perfections

source: །རབ་བརྩོན་བསྒྲུབས་པས་ལོག་པ་མེད།
en: With absolute perseverance, they become irreversible on the path,

source: །ཐབས་མཁས་སྟོབས་རྣམས་ཐོབ་པས་ན།
en: And, since they obtain the powers of skill in means,

source: །དེས་ནི་སེམས་ཅན་སྒྲོལ་བར་བྱེད།
en: They liberate sentient beings.

source: །ཆོས་ཀྱི་མངའ་བདག་ནོར་གྱིས་ནི།
en: “With riches as lords of Dharma,

source: །བརྩེ་སེམས་ཐམས་ཅད་ཀུན་སྡུད་པས།
en: They draw everyone in with their loving minds,

source: །མྱུར་དུ་མི་སྐྱེ་བཟོད་ཐོབ་ནས།
en: Quickly attain acceptance of non-arising,

source: །བྱང་ཆུབ་ལས་ནི་ལྡོག་མི་འགྱུར།
en: And become irreversible from awakening.

source: །གལ་ཏེ་དེ་ལྟར་སྤྱོད་ནུས་ན།
en: “If they are able to act in this way,

source: །སངས་རྒྱས་ཆོས་ནི་ཐོབ་མི་དཀའ།
en: It will not be difficult for them to obtain the Buddhadharma,

source: །རིང་པོར་མི་ཐོགས་བདུད་བཏུལ་ནས།
en: And before long, they will tame the māras

source: །བྱང་ཆུབ་མཆོག་ནི་ཐོབ་པར་འགྱུར།
en: And attain supreme awakening.”

source: །དེ་ནས་བུ་མོ་དེས་ཆོས་དེ་ལྟ་བུ་ཐོས་ནས་དགའ་མགུ་རངས་པར་གྱུར་ནས་བཅོམ་ལྡན་འདས་ལ་འདི་སྐད་ཅེས་གསོལ་ཏོ། །བཅོམ་ལྡན་འདས་ཆོས་དུ་དང་ལྡན་པར་གྱུར་ན་བུད་མེད་ཀྱི་དངོས་པོ་ལས་ལྡོག་པར་འགྱུར་ལགས།
en: Then the girl Vimalaśraddhā, having thus heard the Dharma, greatly rejoiced, and she asked the Blessed One, “Blessed One, how many qualities must one possess to avert female existence?”

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། བུ་མོ་ཆོས་བརྒྱད་དང་ལྡན་པར་གྱུར་ན་བུད་མེད་ཀྱི་དངོས་པོ་ལས་ལྡོག་པར་འགྱུར་རོ། །བརྒྱད་གང་ཞེ་ན།
en: The Blessed One answered, “Girl, when a woman is endowed with eight qualities, she will avert female existence. What are these eight qualities? Not being jealous; not being miserly; not being sly;

source: ཕྲག་དོག་མི་བྱེད་པ་དང་། སེར་སྣ་མི་བྱེད་པ་དང་། གཡོ་སྒྱུ་མེད་པ་དང་། ཁོང་ཁྲོ་བ་མེད་པ་དང་། བདེན་པར་སྨྲ་བ་དང་། ངག་རྩུབ་པོ་མི་སྨྲ་བ་དང་། འདོད་ཆགས་སྤངས་པ་དང་། ལོག་པར་ལྟ་བ་རྣམས་སྤངས་པ་གང་ཡིན་པ་སྟེ།
en: not being angry; speaking the truth; not uttering harsh words; abandoning lust; and abandoning wrong views.

source: བུ་མོ་ཆོས་བརྒྱད་པོ་འདི་དག་མངོན་པར་བསྒྲུབས་ན། མྱུར་དུ་བུད་མེད་ཀྱི་དངོས་པོ་ལས་ལྡོག་པར་འགྱུར་རོ།
en: Girl, when one realizes these eight qualities, one will quickly avert female existence.”

source: གཞན་ལ་ཕྲག་དོག་མི་བྱེད་ཅིང་།
en: Is not jealous of others,

source: །སེར་སྣ་སྤངས་ནས་ཆོས་མོས་དང་། །གཡོ་སྒྱུ་དག་ནི་མི་སྤྱོད་ཅིང་།
en: Abandons miserliness, and Is committed to the Dharma does not act deceitfully.

source: །བུད་མེད་ལུས་ལ་སྐྱོ་བ་དང་། །བྱམས་སེམས་ཞེ་སྡང་རབ་སྤངས་ནས།
en: “Avoiding hatred, with a mind of loving-kindness,

source: །རྟག་པར་བདེན་ཚིག་སྨྲ་བ་དང་། །འདོད་བསལ་ངག་རྩུབ་སྤངས་ནས་ནི། །ཡང་དག་ལྟ་ལ་གནས་པར་བྱ།
en: One always speaks words of truth. Dispelling lust and avoiding harsh words, One should maintain right view.

source: །གང་གིས་བུད་མེད་ལུས་སྐྱོ་ནས།
en: “When, weary of having a female body,

source: །འདི་འདྲའི་ཆོས་ནི་སྒྲུབ་བྱེད་ན།
en: One brings about such qualities,

source: །མྱུར་དུ་བུད་མེད་དངོས་སྤངས་ནས།
en: One will quickly avert female existence,

source: །སྐྱེས་པའི་ལུས་བཟང་ལེན་པར་འགྱུར།
en: And acquire the favorable body of a man.

source: །གཞན་ཡང་བུ་མོ་ཆོས་བརྒྱད་དང་ལྡན་པར་གྱུར་ན། བུད་མེད་ཀྱི་དངོས་པོ་ལས་ལྡོག་པར་འགྱུར་རོ། །བརྒྱད་གང་ཞེ་ན། སངས་རྒྱས་ལ་བླ་མར་བྱེད་ཅིང་།
en: “Furthermore, girl, when a woman is endowed with eight qualities, she will avert female existence. What are these eight qualities?

source: ཆོས་ལ་ཤིན་ཏུ་མོས་པ་དང་། ཚུལ་ཁྲིམས་དང་། བཟོད་པ་དང་། མང་དུ་ཐོས་པ་དང་ལྡན་པའི་དགེ་སྦྱོང་དང་བྲམ་ཟེ་དག་ལ་བསྙེན་བཀུར་དང་རིམ་གྲོར་བྱེད་པ་དང་། སྐྱེས་པ་དང་། བུད་མེད་དང་། ཁྱིམ་གྱི་དངོས་པོ་དག་ལ་མངོན་པར་ཞེན་ཅིང་།
en: Venerating the Buddha and being dedicated to the Dharma; respectfully honoring and venerating ascetics and brahmins endowed with discipline, patience, and great learning; not being attached or clinging to any man, woman, or household matters;

source: ཆགས་པ་མེད་པ་དང་། བསླབ་པའི་དངོས་པོ་ཡང་དག་པར་བླངས་པ་རྣམས་འཇིག་པར་མི་བྱེད་པ་དང་། སྲོག་ཆགས་རྣམས་ལ་ལོག་པའི་བསམ་པ་མི་སྐྱེད་པ་དང་། ལྷག་པའི་བསམ་པས་བུད་མེད་ཀྱི་དངོས་པོ་ལ་ཡོངས་སུ་སྐྱོ་བར་འགྱུར་བ་དང་། བྱང་ཆུབ་ཀྱི་སེམས་ཀྱིས་སྐྱེས་བུ་ཆེན་པོའི་ཆོས་ལ་གནས་པ་དང་། འཇིག་རྟེན་པའི་ཁྱིམ་གྱི་འཚོ་ཚིས་རྣམས་ལ་སྒྱུ་མ་ལྟ་བུ་དང་རྨི་ལམ་ལྟ་བུར་ལྟ་བ་གང་ཡིན་པའོ།
en: not breaking the training precepts to which one has committed; not bringing forth negative intentions toward any living being; with superior intent, being completely weary of female existence; with the mind set on awakening, being set on the qualities of a great man; and viewing worldly household affairs as illusions or dreams.”

source: སངས་རྒྱས་རབ་གུས་ཆོས་ལ་མོས།
en: “When one is devoted to the Buddha and dedicated to the Dharma,

source: །ཚུལ་ཁྲིམས་མང་ཐོས་བླ་མར་བྱེད།
en: Venerates those with discipline and great learning,

source: །འདོད་ཆགས་སྲེད་སེམས་མི་སྐྱེད་ན།
en: And does not bring forth thoughts of desire and craving,

source: །བུད་མེད་དངོས་པོ་མྱུར་དུ་སྤོང་།
en: One will quickly avert female existence.

source: །ཁྲིམས་སྲུང་ངོ་ཚ་ཁྲེལ་ཡོད་ལྡན།
en: “When one keeps discipline with modesty and bashfulness,

source: །གཞན་ལ་མི་བདེན་བསམ་མི་བྱེད།
en: Does not think wrongly of others,

source: །ཐེག་པ་གཞན་ལ་མོས་མེད་ན།
en: One is not inclined to other vehicles,

source: །དེས་ནི་མྱུར་བ་ཁོ་ནར་ཡང་།
en: “Then very soon one will surely avert

source: །མི་གཙང་བུད་མེད་དངོས་པོ་སྤོང་།
en: Impure existence as a woman.

source: །བསམ་པ་མཆོག་གིས་སེམས་སྐྱོ་ནས།
en: When, with supreme intent, one develops weariness,

source: །ཐམས་ཅད་སྒྱུ་མ་ལྟ་བུ་དང་། །ཆོས་རྣམས་རང་བཞིན་གཡོ་མེད་དང་། །རྒྱུ་རྐྱེན་རང་བཞིན་སྟོང་དབེན་ཞེས།
en: Seeing everything as an illusion,

source: །ནན་ཏན་ཡང་དག་ཆོས་བསྒོམས་ན།
en: “And when one persistently meditates on the true Dharma That phenomena are intrinsically unmoving, And that causes and conditions are intrinsically empty and void,

source: །མྱུར་དུ་སྐྱེས་པའི་ལུས་འཐོབ་འགྱུར།
en: One will quickly obtain the body of a man.”

source: །དེ་ནས་བུ་མོ་རྣམ་དག་དད་པས་གསེར་གྱི་ཕྲེང་བ་ཐོགས་པ་དེ་དག་བཅོམ་ལྡན་འདས་ལ་མངོན་པར་གཏོར་བ་དང་། །སྟེང་གི་བར་སྣང་ལ་གསེར་ཡང་དག་པའི་གཞལ་མེད་ཁང་། ཁང་པ་བརྩེགས་པ་དག་ཏུ་གྱུར་ནས་གཞལ་མེད་ཁང་དེ་དག་གི་ནང་ན་སྤྲུལ་པའི་དེ་བཞིན་གཤེགས་པ་གསེར་གྱི་གདན་ལ་བཞུགས་པ། ཤ་སྟག་མངོན་དུ་བྱུང་བར་གྱུར་ཏོ།
en: Then the girl Vimalaśraddhā tossed the golden necklaces she was wearing toward the Blessed One. Rising into the sky, these jewels became perfectly golden celestial palaces and multi-storied mansions, inside of which, seated on golden thrones, there appeared emanations of the Thus-Gone One.

source: །དེ་ནས་བུ་མོ་ལྔ་བརྒྱ་པོ་དེ་དག་གིས་ཀྱང་སོ་སོ་ནས། ལུས་ཀྱི་རྒྱན་རྣམས་བཀྲོལ་ནས་བཅོམ་ལྡན་འདས་ལ་མངོན་པར་གཏོར་བ་དང་། སྟེང་གི་བར་སྣང་ལ་གསེར་གྱི་གཞལ་མེད་ཁང་དང་། རིན་པོ་ཆེའི་གུར་དང་། རིན་པོ་ཆེའི་གདུགས་དང་། བཀོད་པ་རྣམ་པ་སྣ་ཚོགས་སུ་གྱུར་ཏོ།
en: Then each one of the five hundred girls likewise untied the jewelry they were wearing and tossed them toward the Blessed One. The jewelry also rose into the sky and became golden celestial palaces with jeweled pavilions, jeweled parasols, and all kinds of arrays of jewels.

source: །དེ་ནས་བུ་མོ་ལྔ་བརྒྱ་པོ་དེ་དག་གིས་དེ་ལྟ་བུའི་ཆོ་འཕྲུལ་ཆེན་པོ་མཐོང་བ་དང་། སྐད་འཐུན་པར་ཚིགས་སུ་བཅད་དེ་སྨྲས་པ།
en: Thereupon the five hundred girls, having seen this great miracle, uttered these verses in unison:

source: བཅོམ་ལྡན་མི་མཆོག་ཁྱད་པར་འཕགས་པས་ན།
en: “The Blessed One, supreme and foremost among men,

source: །ཐུགས་རྗེས་སེམས་ཅན་རྣམས་ལ་སྨན་པར་མཛད།
en: Through his compassion acts as healer for all sentient beings.

source: །བདག་ཅག་དེང་ནི་བྱང་ཆུབ་སེམས་བསྐྱེད་ནས།
en: We too now give rise to the mind set on awakening,

source: །མོས་པ་རྗེས་འཐུན་རབ་ཏུ་དུལ་ལ་གནས།
en: And remain properly committed to this resolve.

source: །བཅོམ་ལྡན་འདྲེན་པ་བདེ་བ་རབ་སྩོལ་བ།
en: “Blessed One, guide, bestower of happiness,

source: །བདག་ཅག་མི་མཆོག་ལ་ནི་མཆོད་པར་བགྱི།
en: To you, supreme among men, we make offerings.

source: །ཆོས་ཐོས་དབང་གིས་རྡུལ་རྣམས་རབ་སྤངས་ནས།
en: By force of hearing the Dharma, we have discarded all passions,

source: །བདག་ཅག་ཐེ་ཚོམ་ནེམ་ནུར་ཡོངས་མ་མཆིས།
en: And we no longer have any doubts or hesitation.

source: །དེས་ན་བུད་མེད་ཉོན་མོངས་མང་སྤངས་ནས།
en: “Thus leaving behind the many afflictions of women,

source: །ཉོན་མོངས་གཏན་བཅོམ་བདུད་ནི་ཕམ་པར་བགྱི།
en: We will continually overcome the afflictions and defeat Māra, And we will joyously make continuous offerings

source: །ཕྱོགས་བཅུའི་སངས་རྒྱས་བྱེ་བ་ཚད་མེད་རྣམས། །བདག་ཅག་དགའ་བས་རྟག་ཏུ་མཆོད་པར་འཚལ།
en: To the countless buddhas in the ten directions.

source: །སྦྱིན་དང་ཚུལ་ཁྲིམས་བརྩོན་འགྲུས་རབ་གནས་ནས།
en: “Maintaining generosity, discipline, and perseverance,

source: །བཟོད་དང་བསམ་གཏན་སེམས་ནི་རབ་ཏུ་བགྱི།
en: We will train our minds with patience and concentration.

source: །ཐབས་དང་ཤེས་རབ་སེམས་ཅན་ཡོངས་བསྡུས་ནས།
en: And, gathering all sentient beings through insight and skillful means,

source: །བྱང་ཆུབ་མཆོག་ལམ་གང་ལགས་མངོན་དུ་བགྱི།
en: We will realize all the aspects of the path of supreme awakening.

source: །ལྷ་མིའི་འཁོར་ནི་ཚད་མེད་སྨན་བཏགས་ནས།
en: “Conferring remedies to countless assemblies of gods and men,

source: །ཐམས་ཅད་ཐེག་ཆེན་སེམས་ནི་བསྐྱེད་པར་བསྐུལ།
en: We will exhort all to give rise to the spirit of the Great Vehicle;

source: །བདག་ཅག་སེང་གེའི་སྒྲ་ནི་སྒྲོགས་པར་འགྱུར།
en: We will roar the lion’s roar,

source: །བདག་ཅག་ལྷ་མིའི་སྟོན་པ་བགྱིད་པར་མཆི།
en: And become the teachers of gods and men.”

source: །དེ་ནས་བཅོམ་ལྡན་འདས་འཛུམ་པ་མཛད་དོ།
en: At that moment the Blessed One smiled.

source: །སངས་རྒྱས་རྣམས་ཀྱི་ཆོས་ཉིད་ནི་ནམ་འཛུམ་པ་མཛད་པ་ན་འོད་ཟེར་ཁ་དོག་རྣམ་པ་སྣ་ཚོགས་འདི་ལྟ་སྟེ།
en: It is in the nature of the buddhas that when they smile, they emit light rays of various kinds of colors.

source: སྔོན་པོ་དང་། སེར་པོ་དང་། དམར་པོ་དང་། དཀར་པོ་དང་། ལེ་བརྒན་དང་། དངུལ་དང་། ཤེལ་གྱི་ཁ་དོག་ལྟ་བུ་དག་དེ་བཞིན་གཤེགས་པའི་ཞལ་གྱི་སྒོ་ནས་བྱུང་སྟེ། འཇིག་རྟེན་གྱི་ཁམས་ཚད་མེད་དཔག་ཏུ་མེད་པ་དག་ནས། ཚངས་པའི་འཇིག་རྟེན་གྱི་བར་དུ་ཁྱབ་པར་སྣང་བར་བྱས་ནས། དེ་བཞིན་གཤེགས་པ་ལ་ལན་གསུམ་བསྐོར་བ་བྱས་ཏེ། དེ་བཞིན་གཤེགས་པའི་དབུའི་གཙུག་ཏུ་ཐིམ་པར་གྱུར་ཏོ།
en: There were blue, yellow, red, white, orange, violet, and crystalline rays that emanated from the Thus-Gone One’s mouth, which pervaded and illuminated countless and innumerable world systems up to their Brahmā’s realms, then returned and circled the Thus-Gone One three times, and finally dissolved into the Thus-Gone One’s crown protuberance.

source: །དེ་ནས་ཚེ་དང་ལྡན་པ་ཀུན་དགའ་བོ་སྟན་ལས་ལངས་ཏེ། བཅོམ་ལྡན་འདས་ལ་འདི་སྐད་ཅེས་གསོལ་ཏོ། །བཅོམ་ལྡན་འདས་རྒྱུ་རྐྱེན་གང་གི་སླད་དུ་འཛུམ་པ་འདི་ལྟ་བུ་བསྟན་པར་མཛད་ལགས།
en: Then the venerable Ānanda arose from his seat and asked the Blessed One, “Blessed One, what is the reason that you display such a smile?”

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། ཀུན་དགའ་བོ་ཁྱོད་ཀྱིས་བུ་མོ་རྣམ་དག་དད་པ་འདི་མཐོང་ངམ། ཀུན་དགའ་བོས་གསོལ་པ། མཐོང་ལགས་སོ། །བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ།
en: The Blessed One answered, “Ānanda, do you see this girl Vimalaśraddhā?” “Yes, I see her,” Ānanda replied.

source: ཀུན་དགའ་བོ་བུ་མོ་རྣམ་དག་དད་པ་ལ་སོགས་པ་བུ་མོ་ལྔ་བརྒྱ་པོ་འདི་དག་ནི། འདི་ནས་ཚེ་ཟད་པ་དང་། བུད་མེད་ཀྱི་ལུས་སྤངས་ནས་དགའ་ལྡན་གྱི་ལྷའི་རིས་སུ་སྐྱེ་སྟེ།
en: The Blessed One continued, “Ānanda, when the present lives of this girl Vimalaśraddhā and the other five hundred girls are exhausted, they will abandon these female bodies and be reborn among the gods of Tuṣita. There they will respectfully honor, venerate, and make offerings to the Blessed One Maitreya and to all the other thus-gone ones of this fortunate eon.

source: བཅོམ་ལྡན་འདས་བྱམས་པ་དང་། བསྐལ་པ་བཟང་པོའི་དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་ལ་བཀུར་སྟི་དང་། རིམ་གྲོ་དང་། མཆོད་པ་བྱེད་པར་འགྱུར་བས་བུ་མོ་རྣམ་དག་དད་པས་བསྐལ་པ་བྱེ་བ་ཁྲག་ཁྲིག་བརྒྱད་ཁྲི་བཞི་སྟོང་འདས་པའི་འོག་ཏུ་འཇིག་རྟེན་གྱི་ཁམས་གློག་གི་འོད་ཅེས་བྱ་བར་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བར་འགྱུར་ཏེ། དེ་བཞིན་གཤེགས་པ་འོད་ཟེར་གྱི་བཀོད་པ་ཞེས་བྱ་བར་འགྱུར་རོ།
en: In this way, after eighty-four thousand trillion eons, this girl Vimalaśraddhā will obtain perfect and complete awakening in a universe known as Vidyutprabha and will be known as the Thus-Gone One Raśmivyūha.

source: །བསྐལ་པའི་མིང་ནི་རྟག་པར་སྣང་བ་ཞེས་བྱའོ།
en: The name of that eon will be Nityāvabhāsa.

source: །དེ་བཞིན་གཤེགས་པ་དེའི་སྐུ་ཚེའི་ཚད་ནི་དགའ་ལྡན་གྱི་ལྷ་བཞིན་དུ། ཚེ་ལོ་སྟོང་ཕྲག་བཅུ་གཉིས་ཐུབ་པར་འགྱུར་རོ།
en: The life span of that thus-gone one will be the same as that of the gods of Tuṣita, that is, twelve thousand years.

source: །འཇིག་རྟེན་གྱི་ཁམས་དེ་ན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་འབའ་ཞིག་གི་འཁོར་ཚད་མེད་དཔག་ཏུ་མེད་པ་དག་གིས་འཁོར་བྱེད་པར་འགྱུར་རོ།
en: In that universe, he will be surrounded by limitless and immeasurable retinues exclusively consisting of bodhisattva mahāsattvas.

source: །བུ་མོ་ལྔ་བརྒྱ་པོ་འདི་དག་ཀྱང་འཁོར་དེ་དག་གི་ནང་ན་གཙོ་བོ་མཆོག་བྱེད་པར་འགྱུར་ཏེ། ཇི་ལྟར་ད་ལྟར་ངའི་ཚེ་བྱང་ཆུབ་སེམས་དཔའ་འཇམ་དཔལ་ལ་སོགས་པ་དྲུག་ཅུ་པོ་འདི་དག་གཙོ་བོར་གྱུར་པ་བཞིན་ནོ།
en: These five hundred girls will be at the head of those retinues, in the same way as now, during my lifetime, these sixty bodhisattvas—Mañjuśrī and so on —are at the head.

source: །ཀུན་དགའ་བོ་བུད་མེད་གང་ལ་ལ་ཞིག་ཆོས་ཀྱི་རྣམ་གྲངས་འདི་ཐོས་ནས་ཡོངས་སུ་འཛིན་པར་བྱེད། ཀློག་པར་བྱེད། ཁ་ཏོན་དུ་འདོན་པར་བྱེད་ན་བུད་མེད་ཀྱི་ལུས་འདི་དག་གཏུགས་ནས་ཕྱིས་ཡང་ལེན་པར་མི་འགྱུར་ཞིང་མྱུར་དུ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བར་འགྱུར་རོ།
en: Ānanda, if any woman who, having listened to this Dharma discourse, retains it, reads it, or recites it aloud after having had a female body, she will not take such a rebirth again in the future, and will quickly obtain supreme, perfect, and complete awakening.”

source: །བཅོམ་ལྡན་འདས་ཀྱིས་དེ་སྐད་ཅེས་བཀའ་སྩལ་ནས། བུ་མོ་རྣམ་དག་དད་པ་ལ་སོགས་པ་བུ་མོ་ལྔ་བརྒྱ་པོ་དེ་དག་དང་། ལྷ་དང་། མི་དང་། ལྷ་མ་ཡིན་དུ་བཅས་པའི་འཇིག་རྟེན་ཐམས་ཅད་བཅོམ་ལྡན་འདས་ཀྱིས་གསུངས་པ་ལ་རབ་ཏུ་དགའ་ནས་མངོན་པར་བསྟོད་དོ།།
en: After the Blessed One spoke thus, the girl Vimalaśraddhā and the other five hundred girls, as well as the entire world with its gods, men, and asuras, rejoiced in the words of the Blessed One and praised them greatly.

source: །།འཕགས་པ་དཀོན་མཆོག་བརྩེགས་པ་ཆེན་པོའི་ཆོས་ཀྱི་རྣམ་གྲངས་ལེའུ་སྟོང་ཕྲག་བརྒྱ་པ་ལས་བུ་མོ་རྣམ་དག་དད་པས་ཞུས་པའི་ལེའུ་སྟེ་བཞི་བཅུ་པ་རྫོགས་སོ།།
en: This concludes The Questions of the Girl Vimalaśraddhā , the fortieth of the one hundred thousand sections of the Dharma discourse known as The Noble Great Heap of Jewels.
